In [1]:
import pandas as pd
import numpy as np

In [27]:
a = {'이름' : ['홍길동', '사람 1', '사람 2'], '나이' : [20, 30, 25]}

In [28]:
df1 = pd.DataFrame(a)

In [29]:
df1

     이름  나이
0   홍길동  20
1  사람 1  30
2  사람 2  25

In [32]:
b = {'이름' : ['홍길동', '사람 1', '사람 2', '사람 3'], '도시' : ['서울', '서울', '대전', '구미']}

In [33]:
df2 = pd.DataFrame(b)

In [34]:
df2

     이름  도시
0   홍길동  서울
1  사람 1  서울
2  사람 2  대전
3  사람 3  구미

In [39]:
df = pd.merge(left = df1,
             right = df2,
             how = 'left',  # 왼쪽 데이터 기준으로 가져오라 없으면 안가져옴
             left_on = '이름',
             right_on = '이름')

In [40]:
df

     이름  나이  도시
0   홍길동  20  서울
1  사람 1  30  서울
2  사람 2  25  대전

In [37]:
df = pd.merge(left = df1,
             right = df2,
             how = 'right',  # 오른쪽 데이터 기준으로 가져오라 없으면 non
             left_on = '이름',
             right_on = '이름')

In [38]:
df

     이름    나이  도시
0   홍길동  20.0  서울
1  사람 1  30.0  서울
2  사람 2  25.0  대전
3  사람 3   NaN  구미

In [17]:
x1 = (df['도시'] == '서울')

In [18]:
df[x1]

     이름  나이  도시
0   홍길동  20  서울
1  사람 1  30  서울

In [19]:
x2 = (df['도시'] != '서울')

In [20]:
df[x2]

     이름  나이  도시
2  사람 2  25  대전

In [21]:
x3 = (df['나이'] < 30)

In [22]:
df[x3]

     이름  나이  도시
0   홍길동  20  서울
2  사람 2  25  대전

In [23]:
x4 = (df['도시'] == '서울') & (df['나이'] < 30)

In [24]:
df[x4]

    이름  나이  도시
0  홍길동  20  서울

In [25]:
x5 = (df['도시'] == '서울') | (df['나이'] < 30)

In [26]:
df[x5]

     이름  나이  도시
0   홍길동  20  서울
1  사람 1  30  서울
2  사람 2  25  대전